import pandas as pd

data = (
    ( 0.697, 0.460, "是"),
    ( 0.774, 0.376, "是"),
    ( 0.634, 0.264, "是"),
    ( 0.608, 0.318, "是"),
    ( 0.556, 0.215, "是"),
    ( 0.403, 0.237, "是"),
    ( 0.481, 0.149, "是"),
    ( 0.437, 0.211, "是"),
    ( 0.666, 0.091, "否"),
    ( 0.243, 0.267, "否"),
    ( 0.245, 0.057, "否"),
    ( 0.343, 0.099, "否"),
    ( 0.639, 0.161, "否"),
    ( 0.657, 0.198, "否"),
    ( 0.360, 0.370, "否"),
    ( 0.593, 0.042, "否"),
    ( 0.719, 0.103, "否")
)

columns = [ "密度", "含糖率", "标签"]
df = pd.DataFrame(data, columns=columns)

x = df.iloc[:, :-1]
y = df.iloc[:, -1]

#独热码标签编码
x_encoded = pd.get_dummies(x)
y_encoded = pd.get_dummies(y).values  # 生成独热码编码的数组

print(x_encoded)
print(y_encoded)
